{
  "main": {
    "name":"Shay Brennan-Kelly",
    "pronouns": ["he","him"],
    "occupation":"Senior Software Engineer",
    "description":"Interests include blockchain, cybersecurity, diversity and inclusion and generally using my skills to help others",
    "image":"profiler.jpg",
    "bio":["Over the last 6 years I've worked on enterprise software with Java, Typescript, JavaScript, Python, React and Node. In this time I have worked directly with clients onsite, on exploratory co-creation projects and POCs as well as on product teams.",
           "Having started my career in a project management team and then gravitated to engineering, I have experience in areas such as planning, business and process analysis, development, code reviews, testing and supporting live systems. The domains I've worked across include security, risk management, financial systems, blockchain solutions, project management and government systems. ",
           "Studying part-time towards a MSc in Applied Cybersecurity (Level 9). Previous qualifications include a Higher Diploma in Financial Technology (Level 8) and BSc in Computer Science Software Engineering (Level 8). Now that college is finished until September, I'm working towards AWS Developer Associate certification in my spare time."],
    "contactmessage":"I'm currently on the lookout for a Python or Typescript/JavaScript backend role, feel free to connect if you've something that'd suit.",
    "email": "s.brennankelly@gmail.com",
    "address":{
      "city":"Dublin",
      "state":"Ireland"
    },
    "website": "http://www.shay-beekay.com",
    "resumedownload":"https://www.linkedin.com/in/shaybk/",
    "social":[
      {
        "name":"twitter",
        "url":"http://twitter.com/shay_nanigans",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/shaybk/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/shay_nanigans",
        "className":"fa fa-github"
      },
      {
        "name":"skype",
        "url":"http://skype.com",
        "className":"fa fa-skype"
      }
    ]
  },
  "resume":{
    "skillmessage":"Below I've ranked some of my most recent skills, with some of them measured on LinkedIn and PluralSight skills tests. I however have many more tricks up my sleeve.",
    "education":[
      {
        "school":"TU Dublin - Blanchardstown",
        "degree":"Masters Applied Cybersecurity",
        "graduated":"Coming soon..",
        "grade": "Pending",
        "description":"Currently studying part-time (evenings) towards a MSc in Applied Cybersecurity. I am currently completing my Masters Thesis, where I will be contributing to the research on smart contract security, vulnerabilities and associated tooling, with a focus on Solidity and Ethereum.",
        "skills":["Business Continuity Management","Cryptography","Disaster Recovery","Incident Response"," Cybercrime Malware","Smart Contract Security", "Static and Dynamic Analysis","Threat Hunting"]
      },
      {
        "school":"National College of Ireland",
        "degree":"Higher Diploma in Financial Technology",
        "graduated":"November 2018",
        "grade":"1st Class Honours",
        "description":"Completed a night time conversation course in Financial Technology. The scope of this course included blockchain technology, auditing, digital forensics, cryptography and statistics. My final project was a stock price analysis, modeling and prediction tool written in Python",
        "skills":["Blockchain Technology","Cryptography","Cybersecurity","Data Governance","Digital Forensics and Auditing","Data Analytics, Statistics and Data Modelling","Economics","Machine Learning","Research Skills","Smart Contracts"]
      },
      {
        "school":"Maynooth University",
        "degree":"BSc Computer Science Software Engineering",
        "graduated":"September 2015",
        "grade":"1st Class Honours",
        "description":"Studied Psychology for a year before transferring to a pure computer science degree. My final year project was a house price analysis application written in Python, JavaScript and PHP.",
        "skills":["Calculus","Communication and Presentation Skills","Cryptography","Data Analytics","Java","JavaScript","Machine Learning","Networking","Project Management","Python","Research Skills"]
      }
    ],
    "work":[
      {
        "company":"Travizory",
        "title":"Cybersecurity and Privacy Engineering Manager",
        "years":"June 2021 - Present",
        "description":"Ensuring the secure development and operations of Travizory products and solutions, in accordance with compliance requirements. Responsible for ensuring that systems are secure and customer data is afforded the highest level of protection and privacy. This role has a broad scope, from liaising with business and product owners on policy and security controls, implementing security awareness training, investigating incidents, and embedding technical security into our code and products.",
        "skills":["AWS", "Compliance", "Confluence", "Jira", "Kali Linux","SOC2","Technical Writing","Tugboat Logic"]
      },
      {
        "company":"Travizory",
        "title":"Senior Software Engineer",
        "years":"September 2020 - June 2021",
        "description":"n my role as senior software engineer I worked on next generation eVISA, travel authorization and border crossing systems. The scope of this work included planning, requirements analysis, development, testing and documenting systems. Projects included Travizory's API/PNR and Visitor Management Platform products along with shared components within the Travizory tech stack.",
        "skills":["AWS","Bitbucket", "Confluence", "Git","Java","JavaScript", "Jira", "SQL"]
      },
      {
        "company":"Hubspot",
        "title":"Software Engineer",
        "years":"July 2019 - Present",
        "description":"Aligned to Product and Engineering, I develop and enhance internal systems essential to HubSpot's Sales Org. The scope of this role includes planning and task estimation, grooming tickets, development, testing and documenting systems. A core aspect of this role involves the reviewing of development carried out by my team and quality-checking deliverables to ensure they match the specification.",
        "skills":["Git","Guava", "Guice", "Jasmine","Java","JUnit","JavaScript","React","Selenium", "SQL", "MySQL"]
      },
      {
        "company":"Consensys",
        "title":"Software Engineer",
        "years":"August 2018 - June 2019",
        "description":"Contributed to the development of POCs and production level development of distributed Blockchain based systems. The projects involved areas such as smart contracts, zero-trust systems, financial services and identity. The scope of this work included planning, requirements analysis, development, testing and documenting systems. A key part of my role was quality checking the work of and supporting the development of other engineers on my team.", 
        "skills":["Git", "JavaScript","Jest","React","Python","Web3", "Typescript", "Docker", "MongoDB"]
      },
      {
        "company":"Accenture",
        "title":"Software Engineer",
        "years":"June 2017 - July 2018",
        "description":"Transferred to a more engineering-focused role in The Dock. I supervised the work of and mentored more junior engineers within the various projects I was assigned. Project domains included risk management, identity and access management and security.",
        "skills":["Git", "Python", "MongoDB", "Cassandra", "React", "Docker", "SQL", "No SQL"]
      },
      {
        "company":"Accenture",
        "title":"Technology Consultant | Software Engineer",
        "years":"July 2015 - May 2017",
        "description":"I started my career with Accenture Ireland's consulting practice assigned to the Revenue Commissioners. In this role I oversaw the development and enhancement of multiple Java/Angular projects. I lead and mentored a team of 4 junior developers and interns that came into the PMO department. I also implemented an overhaul of the knowledge and content management framework within the ICTL department.",
        "skills":["JUnit","Git", "Java", "Spring (MVC, Boot)", "Selenium", "AngularJS", "Adobe Illustrator", "MySQL", "SQL"]
      }
    ],
    "skills":[
      {
        "name":"AWS",
        "level":"65%"
        },
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"Python",
        "level":"70%"
      },
      {
        "name":"Typescript",
        "level":"70%"
      },
      {
        "name":"Java",
        "level":"80%"
      },
      {
        "name":"SQL",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"API/PNR",
        "category":"Work",
        "image":"travizory.jpg",
        "url":"http://www.travizory.com",
        "description":"Contributed to the development of Travizory's Travel API/PNR Platform"
      },
      {
        "title":"Sales Directory V2",
        "category":"Work",
        "image":"hubs_sq.jpg",
        "description":"Contributed to the design and development of the next generation of Sales Directory, a tool for the Sales Operations Organisation within HubSpot to facilitate the automation and management of quotas for all Sales Representatives across the organisation. This involved working with stakeholders from Sales Ops to understand the pain points of the manual process and then designing and developing a system to automate them in Java."
      },
      {
        "title":"KOMGO - Trade Finance Blockchain Consortium",
        "category":"Work",
        "image":"komgo.jpg",
        "url":"http://www.komgo.io",
        "description":"Contributed to the design and development of an ethereum backed comodities trade finance consortium in Typescript and Solidity. This involved collaborating with stakeholders from Consensys, KOMGO and other contractors."
      },
      {
        "title":"Resume Website",
        "category":"Personal",
        "image":"resume_website.jpg",
        "description":"This website, to showcase my profile, experience, skills and project. Written in Typescript and React"
      },
      {
        "title":"Project Zoran",
        "category":"Work",
        "image":"acn_security.jpg",
        "url":"https://www.accenture.com/us-en/blogs/blogs-identity-management-analytics",
        "description":"Lead the development and maintainance of multiple projects within the ICTL PMO department within Revenue Commissioners. Alongside Revenue staff, I contributed to 4 different projects to develop and enhance bespoke Project Management tooling."
      },
      {
        "title":"PPA - Project and Portfolio Administration",
        "category":"Work",
        "image":"revenue.jpg",
        "description":"Lead the development and maintainance of multiple projects within the ICTL PMO department within Revenue Commissioners. Alongside Revenue staff, I contributed to 4 different projects to develop and enhance bespoke Project Management tooling."
      },
      {
        "title":"Bank of Ireland Motor Insurance",
        "category":"Work",
        "image":"boi.jpg",
        "description":"Together with RSA, I contributed to the development of the first version of BOI Motor."
      }
    ]
  }
}
